Revit 2027 API
BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideError Property
 The segment is being drawn from the wrong side to connect to the location you indicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SegmentDrawnFromWrongSideError { get; }
Public Shared ReadOnly Property SegmentDrawnFromWrongSideError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SegmentDrawnFromWrongSideError {
	FailureDefinitionId^ get ();
}
static member SegmentDrawnFromWrongSideError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace